app/controllers/articles_controller.rb

  def update
    article=Article.find(params[:id])
    article.update(
      {
      title: params[:article][:title],
      description: params[:article][:description]
      }
    )
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2020-11-16 21:51:29.285306"], ["id", 1]]